service frr status
vtysh
enable
conf t (configure terminal) многое подрезано у Cisco
exit
hostname <Name> обозвать роут чтоб не паритс в куче открытых окон

enable password  ***
service password-encryption тоже повторяет циску

*шаблон настройки интерфейса
R1(config)# interface eth0 
R1(config-if)# description to_PC1 - можно указать куда смотрит
R1(config-if)# ip address 10.0.2.1/24 
R1(config-if)# no ip address 10.0.2.1/24 - no перед командой отменяет ее
R1(config-if)# no shutdown / no sh - поднять
end  - сразу на верхний ур

*сохранения текущей конфигаруции в качестве стартовой в энергонезависимую память
copy running-config startup-config / copy run st 

write / wr / wr mem

sh run / show running-config - сморит текущую конфигу
sh star / show startup-config - стартовую

* список и статус всех интерфейсов
sh interface brief 

show ip route - роут табл

*** статика

ip route <адрес сети назначения>/<префикс сети назначения> <next-hop ip-адрес>
R1# conf t
R1(config)# ip route 192.168.2.0/24 (255.255.255.0) 10.0.0.2
R1(config)# exit

*Список всехстатических маршрутов в конфигурации
show running-config | include ip route 

show ip route static -  вывести только статические маршруты

no ip route 10.0.3.0/24 10.0.1.10 - Удаление статического маршрута

show running-config staticd - * статические маршруты в текущей конфигурации на R

directly connected - локальные сети для роута - С

--------------------RIP---------------------------------

Router(config)#router rip
Router(config-router)#version 2
Router(config-router)#network 10.0.1.0/24
Router(config-router)#network 10.0.2.0/24
Router# show ip route rip

--------------------OSPF----------------------------------
Router#conf t
Router(config)#router ospf 1 (опционально номер процесса, пока нах не упаль)
Router(config-router)#ospf router-id 1.1.1.1 (id обычно равен loopback)
Router(config-router)#network 10.0.1.0/24 area 0  - номер ареа не забываем воткнуть 
*
Router(config)# iface eth1      -- замена стоимости на порту
Router(config-if)# ip ospf cost 200  -- делать с двух сторон!
*
Router(config-router)#passive-interface eth1 - интерфейс в сторону конечных сетей (без ospf)
*
проверка работы ospf
Router# show ip ospf int eth1 - подробно на интерфейсе
Router# show ip ospf neighbor - кратенько по соседям
Router# show ip route ospf - показывает маршруты 

**-------------для нескольких зон------------------------*
-----------на ABR-------------
Router(config-router)#area 1 stub                 #Stub area
Router(config-router)#area 1 stub no-summary      #Totally stub area
Router(config-router)#area 1 nssa                 #NSSA area
Router(config-router)#area 1 nssa no-summary      #TNSSA area

no-summary - отключает рассылки LSA3 внутрь зоны

--------------на роутах нумерованных зон-------------------
Router(config-router)#area 1 stub                 #Stub area
Router(config-router)#area 1 stub                 #Totally stub area
Router(config-router)#area 1 nssa                 #NSSA area
Router(config-router)#area 1 nssa                 #TNSSA area

Router(config)#int eth1
Router(config-if)#ip ospf network point-to-point - точка точка только в сторону таких же роутов

show ip ospf database  - а это что бы сделать умный вид и выпал глаз от кучи инфы

***-------------------------BGP----------------------***
номера AS 64512–65535 зарезервированы для внутреннего использования.

  *  указать номер собственной автономной системы;
  *  настроить идентификатор маршрутизатора (router-id);
  *  указать информацию о BGP-соседях;
  *  указать, какие сети необходимо анонсировать соседним роутерам;
  *  настроить политики и фильтры для принимаемых и анонсируемых маршрутов при необходимости;
  *  проверить работу протокола BGP.


1 настраиваем iface 
2 loopback iface
3 поднимаем OSPF - без него R не будут видеть loopback-адреса друг друга
4 interface lo
  ip address 1.1.1.1/32
  ip ospf network point-to-point - loopback как point-to-point
5 R1# configure terminal 
  R1(config)# router bgp 65500
  R1(config-router)# bgp router-id 1.1.1.1
  R1(config-router)# bgp log-neighbor-changes - лог изменений состояния соседа, если откл/вкл - подзапись
  R1(config-router)# end
------show-----------------
  R1# show ip route 2.2.2.2
  R1# ping 2.2.2.2 
------erf;tv cjctltqd--------------- 1 2 и 4 на обоих маршрутизаторах
  R1(config-router)# neighbor 2.2.2.2 remote-as internal - сосед int
  R1(config-router)# neighbor 2.2.2.2 update-source lo  - используем loopback, а не физику, как источник обновлений
  R1(config-router)# address-family ipv4 unicast  - Включает поддержку IPv4-маршрутов в BGP (без этого маршруты не передаются)
  R1(config-router-af)# neighbor 2.2.2.2 activate  - разрешает обмен маршрутов с соседом 
-------------------Анонс сети----------------------
  R1(config-router)# address-family ipv4 unicast
  R1(config-router-af)# network 172.16.10.0/24
